feaser/openblt/Target/Demo/ARMCM7_STM32H7_Nucleo_H743ZI_CubeIDE/Prog/Library/uip/netdev.c
static int32_t   ETH_PHY_IO_GetTick (void);

/* Rx buffer management routines. */
static uint8_t * rxbuf_alloc        (void);

static void      rxbuf_free         (uint8_t  * rx_buf_data);

/* Tx buffer management routines. */
static uint8_t * txbuf_alloc        (void);

static void      txbuf_free         (uint8_t  * tx_buf_data);


/****************************************************************************************
* Local data declarations
****************************************************************************************/
/* MAC adress buffer. */
static struct uip_eth_addr macAddress;

/* LAN8742 PHY component object handle. */
static lan8742_Object_t    lan8742Object;

/* LAN8742 PHY context with I/O function pointers. */
static lan8742_IOCtx_t     lan8742IOCtx =
{
  ETH_PHY_IO_Init,
  ETH_PHY_IO_DeInit,
  ETH_PHY_IO_WriteReg,
  ETH_PHY_IO_ReadReg,
  ETH_PHY_IO_GetTick
};

/* Rx buffer pool. Must be greater than ETH_RX_DESC_CNT yet smaller than 32,
 * otherwise there are not enough rx buffer allocation status flags.
 */

#if defined ( __ICCARM__ ) /* IAR Compiler */
#pragma location=0x30040200
static tRxBuf              rxBufs[ETH_RX_DESC_CNT * 2U];
#elif defined ( __CC_ARM )  /* MDK ARM Compiler */
__attribute__((at(0x30040200))) static tRxBuf rxBufs[ETH_RX_DESC_CNT * 2U];
#elif defined ( __GNUC__ ) /* GNU Compiler */
static tRxBuf              rxBufs[ETH_RX_DESC_CNT * 2U] __attribute__((section(".RxBufSection")));
#endif

/* Rx buffer allocation status flags. */
static uint32_t            rxBufAllocFlags = 0U;

/* Tx buffer pool. Ideally greater than 1 yet smaller than 32, otherwise there are not
 * enough tx buffer allocation status flags.
 */
#if defined ( __ICCARM__ ) /* IAR Compiler */
#pragma location=0x30044200
static tTxBuf              txBufs[2U];
#elif defined ( __CC_ARM )  /* MDK ARM Compiler */
__attribute__((at(0x30044200))) static tTxBuf txBufs[2U];
#elif defined ( __GNUC__ ) /* GNU Compiler */
static tTxBuf              txBufs[2U] __attribute__((section(".TxBufSection")));
#endif

/* Rx buffer allocation status flags. */
static uint32_t            txBufAllocFlags = 0U;


/****************************************************************************************
*            N E T W O R K   D E V I C E   R O U T I N E S
****************************************************************************************/
/************************************************************************************//**
** \brief     Initializes the network device.
**
****************************************************************************************/
void netdev_init(void)
{
  int32_t              phyLinkState;
  uint32_t             duplex;
  uint32_t             speed;
  ETH_MACConfigTypeDef macConf = {0};

  /* Store the default MAC address. */
  macAddress.addr[0] = NETDEV_DEFAULT_MACADDR0;
  macAddress.addr[1] = NETDEV_DEFAULT_MACADDR1;
  macAddress.addr[2] = NETDEV_DEFAULT_MACADDR2;
  macAddress.addr[3] = NETDEV_DEFAULT_MACADDR3;
  macAddress.addr[4] = NETDEV_DEFAULT_MACADDR4;
  macAddress.addr[5] = NETDEV_DEFAULT_MACADDR5;

  /* Initialize Ethernet. */
  heth.Instance = ETH;
  heth.Init.MACAddr = &macAddress.addr[0];
  heth.Init.MediaInterface = HAL_ETH_RMII_MODE;
  heth.Init.TxDesc = DMATxDscrTab;
  heth.Init.RxDesc = DMARxDscrTab;
  heth.Init.RxBuffLen = (UIP_CONF_BUFFER_SIZE + 31) & ~31;
  (void)HAL_ETH_Init(&heth);

  /* Link the PHY I/O functions to the component object and initialize the PHY. */
  LAN8742_RegisterBusIO(&lan8742Object, &lan8742IOCtx);
  LAN8742_Init(&lan8742Object);

  /* Obtain the current link state from the PHY. */
  phyLinkState = LAN8742_GetLinkState(&lan8742Object);

  /* Filter on the state to retrieve the speed and half/full-duplex properties. */
  switch (phyLinkState)
  {
    case LAN8742_STATUS_100MBITS_FULLDUPLEX:
      duplex = ETH_FULLDUPLEX_MODE;
      speed = ETH_SPEED_100M;
      break;
    case LAN8742_STATUS_100MBITS_HALFDUPLEX:
      duplex = ETH_HALFDUPLEX_MODE;
      speed = ETH_SPEED_100M;
      break;
    case LAN8742_STATUS_10MBITS_FULLDUPLEX:
      duplex = ETH_FULLDUPLEX_MODE;
      speed = ETH_SPEED_10M;
      break;
    case LAN8742_STATUS_10MBITS_HALFDUPLEX:
      duplex = ETH_HALFDUPLEX_MODE;
      speed = ETH_SPEED_10M;
      break;
    default:
      duplex = ETH_FULLDUPLEX_MODE;
      speed = ETH_SPEED_100M;
      break;
  }

  /* Get and update the current MAC configuration. */
  HAL_ETH_GetMACConfig(&heth, &macConf);
  macConf.DuplexMode = duplex;
  macConf.Speed = speed;
  HAL_ETH_SetMACConfig(&heth, &macConf);

  /* Kick of the Ethernet packet communication in polling mode. */
  HAL_ETH_Start(&heth);
} /*** end of netdev_init ***/


/************************************************************************************//**
** \brief     Initializes the MAC address of the network device.
**
****************************************************************************************/
void netdev_init_mac(void)
{
  /* Configure the MAC address */
  uip_setethaddr(macAddress);
} /*** end of netdev_init_mac ***/


/************************************************************************************//**
** \brief     Obtains the MAC address of the network device.
** \param     mac_addr MAC address storage buffer as a byte array.
**
****************************************************************************************/
void netdev_get_mac(unsigned char * mac_addr)
{
  mac_addr[0] = macAddress.addr[0];
  mac_addr[1] = macAddress.addr[1];
  mac_addr[2] = macAddress.addr[2];
  mac_addr[3] = macAddress.addr[3];
  mac_addr[4] = macAddress.addr[4];
  mac_addr[5] = macAddress.addr[5];
} /*** end of netdev_get_mac ***/


/************************************************************************************//**
** \brief     Read newly received data from the network device.
** \details   Copy the newly received data to the uip_buf byte buffer. Keep in mind its
**            maximum size (UIP_CONF_BUFFER_SIZE).
** \return    Number of newly received bytes that were copied to uip_buf or 0 if no new
**            data was received.
**
****************************************************************************************/
unsigned int netdev_read(void)
{
  unsigned int   result = 0;
  tRxBuf       * rxBuf  = NULL;

