feaser/openblt/Target/Demo/ARMCM7_STM32H7_Nucleo_H743ZI_CubeIDE/Prog/Library/uip/netdev.c
  /* Check for newly receive data. Note this function triggers HAL_ETH_RxLinkCallback()
   * one or more times to build a chain link of tRxBufs. If new data was available,
   * the pointer to the first chain in the link is stored in rxBuf.
   */
  if (HAL_ETH_ReadData(&heth, (void **)&rxBuf) == HAL_OK)
  {
    /* Only continue with a valid buffer pointer, meaning that a chain link was built. */
    if (rxBuf != NULL)
    {
      /* Iterate over all the links in the chain. */
      for (tRxBuf * p = rxBuf; p != NULL; p = p->next)
      {
        /* Only copy the data for later processing if it actually fits in the uip_buf
         * and if the length and total length elements are valid.
         */
        if ((p->length > 0U) && (p->total_length > 0U) &&
            (p->length <= p->total_length) && (p->total_length <= UIP_CONF_BUFFER_SIZE))
        {
          /* Append the data from this chain link to the uIP data buffer. */
          memcpy(&uip_buf[result], p->data, p->length);
          /* Update the result. */
          result += p->length;
        }
        /* Release the allocated Rx buffer now that we're done with it. Keep in mind
         * that it's freed by specifying the address of its data pointer.
         */
        rxbuf_free(p->data);
      }
    }
  }
  /* Give the result back to the caller. */
  return result;
} /*** end of netdev_read ***/


/************************************************************************************//**
** \brief     Send data on the network device.
** \details   The data to set in available in the uip_buf byte buffer and the number of
**            bytes to send is stored in uip_len.
**
****************************************************************************************/
void netdev_send(void)
{
  ETH_TxPacketConfig   txPacketConfig = {0};
  ETH_BufferTypeDef    txBuffer       = {0};
  uint8_t            * txData;

  /* Allocate a new tx data buffer from the pool. */
  txData = txbuf_alloc();

  /* Only continue if the allocation succeeded. */
  if (txData != NULL)
  {
    /* Copy the packet data to the tx data buffer. */
    memcpy(txData, uip_buf, uip_len);

    /* Prepare the transmit buffer. This implementation assumes that a single ETH
     * transmit descriptor can handle the packet with a size up to UIP_CONF_BUFFER_SIZE.
     * Note that the STM32 Ethernet peripheral can handle up to 32k bytes per ETH
     * transmit descriptor.
     */
    txBuffer.buffer = txData;
    txBuffer.len    = uip_len;
    txBuffer.next   = NULL;

    /* Prepare transmit packet configuration. */
    txPacketConfig.Attributes   = ETH_TX_PACKETS_FEATURES_CSUM |
                                  ETH_TX_PACKETS_FEATURES_CRCPAD;
    txPacketConfig.ChecksumCtrl = ETH_CHECKSUM_IPHDR_PAYLOAD_INSERT_PHDR_CALC;
    txPacketConfig.CRCPadCtrl   = ETH_CRC_PAD_INSERT;
    txPacketConfig.Length       = uip_len;
    txPacketConfig.TxBuffer     = &txBuffer;
    txPacketConfig.pData        = txBuffer.buffer;

    /* Submit request to transmit the Ethernet Packet in polling mode. */
    HAL_ETH_Transmit(&heth, &txPacketConfig, NETDEV_TX_PACKET_TIMEOUT_MS);

    /* Release the previously allocated tx data buffer back to the pool. Keep in mind
     * that it's freed by specifying the address of its data pointer.
     */
    txbuf_free(txData);
  }
} /*** end of netdev_send ***/


/****************************************************************************************
*            R X   B U F F E R   M A N A G E M E N T   R O U T I N E S
****************************************************************************************/
/************************************************************************************//**
** \brief     Allocate a new Rx buffer from the pool.
** \return    Pointer to the allocated Rx buffer's data element if successful, NULL
**            otherwise.
**
****************************************************************************************/
static uint8_t * rxbuf_alloc(void)
{
  uint8_t *     result      = NULL;
  const uint8_t totalRxBufs = sizeof(rxBufs)/sizeof(rxBufs[0]);

  /* Find the next free buffer. */
  for (uint8_t rxBufIdx = 0; rxBufIdx < totalRxBufs; rxBufIdx++)
  {
    /* Is the buffer at this index available? */
    if ((rxBufAllocFlags & (1 << rxBufIdx)) == 0U)
    {
      /* Flag this one as allocated. */
      rxBufAllocFlags |= (1 << rxBufIdx);
      /* Update the result. */
      result = rxBufs[rxBufIdx].data;
      /* Stop the loop. */
      break;
    }
  }
  /* Give the result back to the caller. */
  return result;
} /*** end of rxbuf_alloc ***/


/************************************************************************************//**
** \brief     Releases a previously allocated Rx buffer and give it back to the pool.
** \param     rx_buf_data Pointer to the allocated Rx buffer's data element.
**
****************************************************************************************/
static void rxbuf_free(uint8_t * rx_buf_data)
{
  const uint8_t totalRxBufs = sizeof(rxBufs)/sizeof(rxBufs[0]);

  /* Find the index of the specified buffer in the pool. */
  for (uint8_t rxBufIdx = 0; rxBufIdx < totalRxBufs; rxBufIdx++)
  {
    /* Is this the one that should be released? */
    if (rxBufs[rxBufIdx].data == rx_buf_data)
    {
      /* Flag this one as free. */
      rxBufAllocFlags &= ~(1 << rxBufIdx);
      /* Stop the loop. */
      break;
    }
  }
} /*** end of rxbuf_free ***/


/****************************************************************************************
*            T X   B U F F E R   M A N A G E M E N T   R O U T I N E S
****************************************************************************************/
/************************************************************************************//**
** \brief     Allocate a new Tx buffer from the pool.
** \return    Pointer to the allocated Tx buffer's data element if successful, NULL
**            otherwise.
**
****************************************************************************************/
static uint8_t * txbuf_alloc(void)
{
  uint8_t *     result      = NULL;
  const uint8_t totalTxBufs = sizeof(txBufs)/sizeof(txBufs[0]);

  /* Find the next free buffer. */
  for (uint8_t txBufIdx = 0; txBufIdx < totalTxBufs; txBufIdx++)
  {
    /* Is the buffer at this index available? */
    if ((txBufAllocFlags & (1 << txBufIdx)) == 0U)
    {
      /* Flag this one as allocated. */
      txBufAllocFlags |= (1 << txBufIdx);
      /* Update the result. */
      result = txBufs[txBufIdx].data;
      /* Stop the loop. */
      break;
    }
  }
  /* Give the result back to the caller. */
  return result;
} /*** end of txbuf_alloc ***/


/************************************************************************************//**
** \brief     Releases a previously allocated Tx buffer and give it back to the pool.
** \param     tx_buf_data Pointer to the allocated Tx buffer's data element.
**
****************************************************************************************/
static void txbuf_free(uint8_t * tx_buf_data)
{
  const uint8_t totalTxBufs = sizeof(txBufs)/sizeof(txBufs[0]);

  /* Find the index of the specified buffer in the pool. */
  for (uint8_t txBufIdx = 0; txBufIdx < totalTxBufs; txBufIdx++)
  {
    /* Is this the one that should be released? */
    if (txBufs[txBufIdx].data == tx_buf_data)
    {
      /* Flag this one as free. */
      txBufAllocFlags &= ~(1 << txBufIdx);
      /* Stop the loop. */
      break;
    }
  }
} /*** end of txbuf_free ***/


/****************************************************************************************
*            H A L   C A L L B A C K   R O U T I N E S
****************************************************************************************/
/************************************************************************************//**
** \brief     Callback to allocate a packet reception buffer.
** \param     buff Pointer for storing the allocation results.
**
****************************************************************************************/
void HAL_ETH_RxAllocateCallback(uint8_t ** buff)
{
  /* Allocate a new Rx buffer from the pool. */
  *buff = rxbuf_alloc();
} /*** end of HAL_ETH_RxAllocateCallback ***/


/************************************************************************************//**
** \brief     Callback to process newly received data.
** \param     pStart pointer to packet start
** \param     pEnd pointer to packet end
** \param     buff pointer to received data
** \param     length received data length
**
****************************************************************************************/
void HAL_ETH_RxLinkCallback(void     ** pStart,
                            void     ** pEnd,
                            uint8_t  *  buff,
                            uint16_t    length)
{
  tRxBuf ** ppStart = (tRxBuf **)pStart;
  tRxBuf ** ppEnd   = (tRxBuf **)pEnd;
  tRxBuf *  p;

