feaser/openblt/Target/Demo/ARMCM7_STM32H7_Nucleo_H743ZI_CubeIDE/Prog/Library/uip/netdev.c
  /* Get the tRxBuf pointer from the buff address. */
  p = (tRxBuf *)(buff - offsetof(tRxBuf, data));
  p->next = NULL;
  p->total_length = 0;
  p->length = length;

  /* Chain the buffer. */
  if (!*ppStart)
  {
    /* The first buffer of the packet. */
    *ppStart = p;
  }
  else
  {
    /* Chain the buffer to the end of the packet. */
    (*ppEnd)->next = p;
  }
  *ppEnd = p;

  /* Update the total length of all the buffers of the chain. Each link in the chain
   * should have its total_length set to its own length, plus the length of all the
   * following links in the chain.
   */
  for (p = *ppStart; p != NULL; p = p->next)
  {
    p->total_length += length;
  }

  /* D-Cache enabled? */
  if ((SCB->CCR & SCB_CCR_DC_Msk) != 0U)
  {
    /* Invalidate d-Cache because Rx DMA's writing to physical memory makes it stale. */
    SCB_InvalidateDCache_by_Addr((uint32_t *)buff, length);
  }
} /*** end of HAL_ETH_RxLinkCallback ***/


/****************************************************************************************
*            E T H E R N E T   P H Y   I / O   R O U T I N E S
****************************************************************************************/
/************************************************************************************//**
** \brief     Initializes the MDIO interface GPIO and clocks.
** \details   This function assumes that the MDIO GPIO configuration is already done.
** \return    0 if successful, -1 otherwise.
**
****************************************************************************************/
static int32_t ETH_PHY_IO_Init(void)
{
  /* Configure the MDIO Clock. */
  HAL_ETH_SetMDIOClockRange(&heth);
  return 0;
} /*** end of ETH_PHY_IO_Init ***/


/************************************************************************************//**
** \brief     De-Initializes the MDIO interface.
** \return    0 if successful, -1 otherwise.
**
****************************************************************************************/
static int32_t ETH_PHY_IO_DeInit(void)
{
  /* Nothing to do for this specific PHY. */
  return 0;
} /*** end of ETH_PHY_IO_DeInit ***/


/************************************************************************************//**
** \brief     Read a PHY register through the MDIO interface.
** \param     devAddr PHY port address
** \param     regAddr PHY register address
** \param     regValPtr Pointer to hold the register value.
** \return    0 if successful, -1 otherwise.
**
****************************************************************************************/
static int32_t ETH_PHY_IO_ReadReg(uint32_t   devAddr,
                                  uint32_t   regAddr,
                                  uint32_t * regValPtr)
{
  int32_t result = 0;

  if (HAL_ETH_ReadPHYRegister(&heth, devAddr, regAddr, regValPtr) != HAL_OK)
  {
    result = -1;
  }
  /* Give the result back to the caller. */
  return result;
} /*** end of ETH_PHY_IO_ReadReg ***/


/************************************************************************************//**
** \brief     Write a value to a PHY register through the MDIO interface.
** \param     devAddr PHY port address
** \param     regAddr PHY register address
** \param     regVal Value to be written.
** \return    0 if successful, -1 otherwise.
**
****************************************************************************************/
static int32_t ETH_PHY_IO_WriteReg(uint32_t devAddr,
                                   uint32_t regAddr,
                                   uint32_t regVal)
{
  int32_t result = 0;

  if (HAL_ETH_WritePHYRegister(&heth, devAddr, regAddr, regVal) != HAL_OK)
  {
    result = -1;
  }
  /* Give the result back to the caller. */
  return result;
} /*** end of ETH_PHY_IO_WriteReg ***/


/************************************************************************************//**
** \brief     Get the time in milliseconds used for internal PHY driver process.
** \return    Current system time in milliseconds.
**
****************************************************************************************/
static int32_t ETH_PHY_IO_GetTick(void)
{
  return HAL_GetTick();
} /*** end of ETH_PHY_IO_GetTick ***/


/*********************************** end of netdev.c ***********************************/
